[
  {
   "version": "3.1.3",
   "type": "Revision",
   "date": "14th December 2017",
   "overview": "New projects and spacing.",
   "updates": [
     "Added top margin to all main pages.",
     "Added first term of second year programming projects."
   ]
  },
  {
    "version": "3.1.2",
    "type": "Revision",
    "date": "6th May 2017",
    "overview": "Minor Detail Updates.",
    "updates": [
      "Added description to about page.",
      "Minor CSS changes."
    ]
  },
  {
    "version": "3.1.1",
    "type": "Revision",
    "date": "20th April 2017",
    "overview": "Added Google Analytics Tracking.",
    "updates": [
      "Added Google Analytics Tracking.",
      "Added Privacy Policy page.",
      "Added link to Privacy Policy in footer."
    ]
  },
  {
    "version": "3.1.0",
    "type": "Minor",
    "date": "19th April 2017",
    "overview": "Added search functionality for projects based on programming language and category.",
    "updates": [
      "Added search functionality for projects based on programming language.",
      "Added search functionality for projects based on category.",
      "Added Latest Project and Featured Project to homepage.",
      "Added pager to all project pages for easier navigation.",
      "Centered page headers for projects, updates and skills.",
      "Centered title and language list for all project pages",
      "Added Live project links to relevant projects.",
      "Made links that go offsite open in a new tab."
    ]
  },
  {
    "version": "3.0.2",
    "type": "Revision",
    "date": "9th April 2017",
    "overview": "Switched to custom domain kylegough.co.uk",
    "updates": [
      "Switched to custom domain kylegough.co.uk.",
      "Hosted website with AWS Elastic Beanstalk",
      "Added Github links to relevant projects."
    ]
  },
  {
    "version": "3.0.1",
    "type": "Revision",
    "date": "7th April 2017",
    "overview": "Changed some default Materialize CSS to custom CSS.",
    "updates": [
      "Added text shadow to navigation bar and footer.",
      "Added new styling to buttons to match colour scheme.",
      "Added content to homepage, including custom made icons for links to other pages."
    ]
  },
  {
    "version": "3.0.0",
    "type": "Major",
    "date": "7th April 2017",
    "overview": "Converted website from using Bootstrap 3 to Materialize.",
    "updates": [
      "Added scrollspy on the sidebar of the project page.",
      "Added scrollspy for all project pages.",
      "Converted website from Bootstrap CSS to Materialize CSS.",
      "Converted Project page data from HTML into JSON format for easier maintainability.",
      "Converted Update page data from HTML into JSON format for easier maintainability.",
      "Improved style of skill bar used on about page.",
      "Coloured language chips based on category."
    ]
  },
  {
    "version": "2.1.0",
    "type": "Minor",
    "date": "19th March 2017",
    "overview": "Integrated PHP pages for shared and more maintainable header, navigation bar and footer.",
    "updates": [
      "Updated the structure of project pages to include tabs for main areas.",
      "Updated HTML pages to PHP so the head, navigation bar and footer could be contained in one file.",
      "Recreated the footer so include various links across the site and display when the page was last modified.",
      "Added unique showcase pictures for every project, and added additional pictures for existing projects.",
      "Made site look better on mobile devices. Still needs additional spacing on certain pages."
    ]
  },
  {
    "version": "2.0.0",
    "type": "Major",
    "date": "12th February 2017",
    "overview": "Started integrating Bootstrap 3 for mobile responsiveness.",
    "updates": [
      "Started process of recreating website using Bootstrap 3.",
      "Added badges to indicate what languages each project utilises, colour coded by contribution.",
      "Added an image for each project.",
      "Restyled and restructures all pages of the website.",
      "Restyled the navigation bar across the website.",
      "Added circular image links on the homepage to important pages in the website.",
      "Added a responsive full-width image to top of the homepage containing the circular images."
    ]
  },
  {
    "version": "1.1.1",
    "type": "Revision",
    "date": "2nd February 2017",
    "overview": "Added University projects to the project list.",
    "updates": [
      "Added Projects on Project page for First Year University coursework.",
      "Rewrote project details as bullet points instead of paragraphs."
    ]
  },
  {
    "version": "1.1.0",
    "type": "Minor",
    "date": "19th January 2017",
    "overview": "Converted CSS to Sass for increased ease of use and maintainability of styling.",
    "updates": [
      "Converted main CSS file into seperate Sass files for ease of use.",
      "Implemented a normalise CSS file.",
      "Fixed list and text spacing.",
      "Reduced margin between content boxes.",
      "Removed nav-spacer div element, replaced by adding top padding to the body of the document.",
      "Made progress bars on about page mobile responsive. Design still needs improvement.",
      "Added image overlays on homepage with links to the Project and About page. Styled so they darken when hovered over.",
      "Changed update page to list changes per week instead of per day to minimise the number of seperate boxes to improve readability.",
      "Added drop down navigation menu for mobile devices.",
      "Re-worked navigation menu in SCSS for desktop and mobile support."
    ]
  },
  {
    "version": "1.0.2",
    "type": "Revision",
    "date": "12th January 2017",
    "overview": "Added some more content to about and project pages as well as a new JavaScript image slideshow.",
    "updates": [
      "Added updated content to the project and about pages.",
      "Added Image Slideshows for every project using JavaScript."
    ]
  },
  {
    "version": "1.0.1",
    "type": "Revision",
    "date": "2nd January 2017",
    "overview": "Redesigned website with an improved colour scheme and design as well as some additional content.",
    "updates": [
      "Added shadows to the bottom of the header.",
      "Added a contat form to the about page.",
      "Added a footer to every page.",
      "Added some images to the project page.",
      "Added content to the homepage.",
      "Updated Favicon.",
      "Added fade animation to all links that change colour.",
      "Changed coloured backgrounds to faint static noise backgrounds.",
      "Fixed navigation bar to show links on the same line.",
      "Added Github link on navigatio bar.",
      "Added some media queries for basic navigation disappearance on smaller devices."
    ]
  },
  {
    "version": "1.0.0",
    "type": "Major",
    "date": "26th December 2016",
    "overview": "Created the website using only HTML and CSS. Created pages for projects, about me and updates.",
    "updates": [
      "Added pages: Index, About Me, Projects and Updates.",
      "Added CSS file for website sections, navigation bar and header.",
      "Added separate pages for each update.",
      "Added most recent update section to index page.",
      "Added sorting visualiser to project list.",
      "Added delivery route planner to project list.",
      "Added portfolio to project list.",
      "Added steganography embedder to project list.",
      "Added manual image slideshow for each project.",
      "Added fonts: Vintage Avalanche and Existence with compatibility for all browsers.",
      "Added collapsable sections to the update page.",
      "Added simple colour scheme across website."
    ]
  }
]
